# ForceVector2 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..ForceVector2 Property
AreaLoad Class See Also
---
The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ ForceVector2 { get; set; }
```

Visual Basic
---
```text
Public Property ForceVector2 As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ ForceVector2 {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Remarks
The default force unit is kN/m^2 for metric, and ksf for imperial. Use UnitUtils class methods to convert value from or to internal units.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace